# Выбираем "базу" для нашей коробки — среду с Node.js
FROM node:20-alpine

# Устанавливаем pnpm внутри коробки
RUN npm install -g pnpm

# Создаем папку для приложения внутри коробки
WORKDIR /app

# Копируем файлы с зависимостями (обрати внимание на pnpm-lock.yaml)
COPY package.json pnpm-lock.yaml ./

# Устанавливаем все нужные пакеты
RUN pnpm install

# Копируем весь остальной код нашего сайта
COPY . .

# Собираем оптимизированную версию сайта
RUN pnpm run build

# Говорим коробке, какой порт открыть
EXPOSE 3000

# Команда, которая запустит сайт, когда коробка откроется
CMD ["pnpm", "start"]